Repository: shayanzare-dev/portfolio
Catalog: lib/l10n/intl_*.arb
Languages: fa

# title
source: Shayan Zare Portfolio
fa: پورتفولیو شایان زارع

# profileDescription
source: I am a results-oriented Mobile Developer with 3.5+ years of experience in cross-platform mobile development using Flutter and React Native. Skilled in designing, developing, and deploying high-performance mobile applications with clean architecture, efficient state management, and scalable code. I focus on creating intuitive, reliable, and visually engaging user experiences that drive real business impact. I thrive at the intersection of design and engineering, where creativity meets logic. I am highly proficient in writing test-driven code, optimizing app performance, and collaborating with cross-functional teams throughout the full development lifecycle. Constantly learning and improving, I aim to build mobile products that not only work flawlessly but also deliver meaningful experiences that users remember.
fa: توسعه دهنده موبایل با بیش از ۳.۵ سال تجربه در ساخت اپلیکیشن های سریع، زیبا و پایدار با استفاده از Flutter و React Native. ایده های پیچیده را به تجربه های روان و جذاب تبدیل می کنم — با معماری تمیز، مقیاس پذیر و ماندگار. ذهنی کنجکاو، مسئولیت پذیر و با یک هدف ساده: خلق اپ هایی که زنده به نظر می رسند.

# name
source: Shayan
fa: شایان

# family
source: Zare
fa: زارع

# socialTitle
source: Find me in Socials
fa: من رو در شبکه های اجتماعی پیدا کنید

source: Twitter
fa: توییتر

source: LinkedIn
fa: لینکدین

source: Github
fa: گیت هاب

source: Medium
fa: مدیوم

source: Stack Overflow
fa: استک اورفلو

source: telegram
fa: تلگرام

source: Software Developer
fa: توسعه دهنده نرم افزار

# cvButton
source: Download CV
fa: دانلود رزومه

source: Hire Me!
fa: اطلاعات تماس

# softwareDeveloperDescription
source: I'm a software developer who loves building innovative apps, learning continuously, and tackling challenges. I specialize in mobile development using Flutter and React Native, creating smooth, scalable, and cross-platform mobile experiences.
fa: من یک توسعه دهنده موبایل نتیجه گرا هستم با بیش از ۳.۵ سال تجربه در توسعه اپلیکیشن های Cross-Platform با استفاده از Flutter و React Native. در طراحی، توسعه و استقرار اپلیکیشن های موبایل با عملکرد بالا، معماری تمیز، مدیریت وضعیت بهینه و کد مقیاس پذیر مهارت دارم. تمرکز من بر خلق تجربه های کاربری روان، پایدار و جذاب است که تأثیر واقعی بر کسب وکار دارند. من در نقطه ای رشد می کنم که طراحی و مهندسی به هم می رسند — جایی که خلاقیت با منطق ترکیب می شود. در نوشتن کدهای تست محور، بهینه سازی عملکرد اپلیکیشن ها و همکاری با تیم های چند تخصصی در تمام مراحل توسعه مهارت بالایی دارم. همیشه در حال یادگیری و پیشرفت هستم، چون باور دارم محصولات بزرگ را کسانی می سازند که تنها به عملکرد فکر نمی کنند، بلکه به احساس و تجربه کاربر اهمیت می دهند. هدف من خلق اپلیکیشن هایی است که نه تنها به خوبی کار می کنند، بلکه تجربه ای ماندگار و الهام بخش برای کاربر رقم می زنند.

source: Open Source
fa: متن باز

# openSourceDescription
source: Open source has been one of my greatest teachers it shaped how I think, build, and collaborate. Today, I’m proud to give back to the same community that fueled my growth. I dedicate part of my time to contributing to open-source projects, sharing knowledge, and engaging with developer communities around the world. Even this portfolio is open source a reflection of my belief that great software is built in the open.
fa: جامعه ی Open Source یکی از بزرگ ترین معلمان من بوده است؛ دیدگاه من به ساخت نرم افزار، همکاری و یادگیری را شکل داده است. امروز با افتخار بخشی از زمانم را صرف بازگرداندن به همان جامعه ای می کنم که مسیر رشدم را هموار کرد. در پروژه های متن باز مشارکت دارم، دانشم را به اشتراک می گذارم و با جوامع توسعه دهندگان در سراسر دنیا در ارتباطم. حتی این وب سایت نمونه کار من نیز متن باز است چون باور دارم نرم افزارهای بزرگ، در فضای باز ساخته می شوند.

source: Mobile Team Lead
fa: لیدر تیم موبایل

# mobileTeamLeadDescription
source: Acted as the Mobile Team Lead, managing a team of 6 developers to build scalable cross-platform apps using Flutter And Agile method. Improved code quality and team velocity through mentorship, CI/CD setup, and enforcing best development practices. Delivered multiple projects under tight deadlines with exceptional user satisfaction.
fa: به عنوان لیدر تیم موبایل فعالیت داشتم و تیمی متشکل از 6 توسعه دهنده را برای ساخت اپلیکیشن های مقیاس پذیر چندپلتفرمی با استفاده از Flutter و متد Agile مدیریت کردم. با منتورینگ اعضای تیم، راه اندازی CI/CD و پیاده سازی بهترین استانداردهای توسعه، کیفیت کد و سرعت عملکرد تیم را به طور قابل توجهی بهبود دادم. چندین پروژه را در بازه های زمانی فشرده با موفقیت تحویل دادیم و رضایت بالایی از سمت کاربران کسب شد.

source: Design Tools
fa: ابزارهای طراحی

# designToolsDescription
source: I’m deeply interested in product design principles, tools, and user-centered design methods. I enjoy learning how great products are crafted from idea to experience. Skilled in Figma and Adobe XD, I use these tools to translate concepts into clean, intuitive, and visually engaging mobile interfaces.
fa: من علاقه ی زیادی به اصول طراحی محصول، ابزارهای طراحی و متدهای طراحی کاربرمحور دارم و از یادگیری روند خلق محصولات موفق از ایده تا تجربه نهایی لذت می برم. در استفاده از ابزارهایی مانند Figma و Adobe XD مهارت دارم و از آن ها برای تبدیل مفاهیم به رابط های کاربری تمیز، شهودی و چشم نواز استفاده می کنم.

# persianFlutterCommunityDescription
source: Persian Flutter is a Community for Persian language developers of Flutter. Our goal is to be able to expand the Persian-speaking community through a series of events, trainings and experiences. For more information about this community and events, you can visit the PersianFlutter.com site.
fa: Persian Flutter Community description

# rasecretDescription
source: Rasecret is a product that focuses on personal development. I was in this team to participate in the development of the mobile application of this product. We used flutter to develop the mobile application of this product.
fa: RaSecret description

# droppCommerceDescription
source: DroppCommerce is a location-based online store. We used the flutter and vue.js have been used to front-end development and node.js has been used back-end. you can find other info about it on DroppCommerce.ir
fa: Dropp Commerce description
